app/Controllers/pesanan.php

    public function index()
    {
        $model = new PesananModel();

        // Mengambil semua data dari tabel pesanan
        $data['pesanan'] = $model->findAll();
---
SELECT *
FROM `pesanan`